# NaN: Not a Number

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
n = np.nan

In [3]:
type(n)

float

In [43]:
m = 1
m/n  # any value + NaN = NaN

nan

# NaN in Series

In [5]:
s1 = Series([1, 2, np.nan, 3, 4],index = ['a', 'b','c','d','d'])

In [6]:
s1

a    1.0
b    2.0
c    NaN
d    3.0
d    4.0
dtype: float64

In [7]:
s1.isnull()

a    False
b    False
c     True
d    False
d    False
dtype: bool

In [8]:
s1.notnull()

a     True
b     True
c    False
d     True
d     True
dtype: bool

In [9]:
s1.dropna()

a    1.0
b    2.0
d    3.0
d    4.0
dtype: float64

# NaN in Dataframe

In [11]:
df = DataFrame([[1, 2, 3], [np.nan, 5, 6,],[7, np.nan, 9],[np.nan, np.nan, np.nan]])

In [12]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [14]:
df.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [15]:
df.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [28]:
df1 = df.dropna(axis= 0, how = 'any')  # drop nan as long as there is nan

In [29]:
df1

     0    1    2
0  1.0  2.0  3.0

In [20]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [26]:
df1 = df.dropna(axis= 0, how = 'all')

In [27]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [21]:
df1 = df.dropna(axis= 1)

In [22]:
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [30]:
df2 = df = DataFrame([[1, 2, np.nan], [np.nan, 5, 6,],[7, np.nan, 9],[np.nan, np.nan, np.nan]])

In [31]:
df2

     0    1    2
0  1.0  2.0  NaN
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [32]:
df2.dropna(thresh = None)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [47]:
df2.dropna(thresh = 2) # > 2 then drop it

     0    1    2
0  1.0  2.0  NaN
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [35]:
df2.fillna(value =1)

     0    1    2
0  1.0  2.0  1.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0

In [49]:
df2.fillna(value = {0:0,1:1,2:2})

     0    1    2
0  1.0  2.0  2.0
1  0.0  5.0  6.0
2  7.0  1.0  9.0
3  0.0  1.0  2.0

In [38]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [40]:
df

     0    1    2
0  1.0  2.0  NaN
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN